[
  {
    "image": "https://logo.clearbit.com/tiktok.com",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "id": 1,
    "description": "Explore a universe of daily fun with short-form videos. TikTok is the global hub for discovering, creating, and sharing authentic and engaging content. Dive into an endless stream of videos tailored to your interests, covering everything from comedy, dance, and music to food, sports, and life hacks. The powerful recommendation engine ensures you'll always find content that sparks joy, whether you’re a seasoned content creator or a casual viewer. Use intuitive, easy-to-master editing tools, trendy filters, and a massive library of sounds to bring your own stories to life. Engage with a vibrant global community by liking, commenting, and sharing content, or even participating in the latest viral trends and challenges. It’s a platform designed for genuine connection, self-expression, and endless entertainment, connecting billions of users across the planet. Get ready to watch, engage, and share content globally.",
    "size": 185,
    "reviews": 4500000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 3200000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/whatsapp.com",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "id": 2,
    "description": "Simple, reliable, and private messaging and calling for free, available worldwide. WhatsApp provides end-to-end encryption for your most personal conversations, ensuring that only you and the person you're communicating with can read or listen to what is sent—not even WhatsApp. The app supports text, voice messages, high-definition video calls, and group chats, making it easy to stay connected with family, friends, and colleagues regardless of their location. Share photos, videos, documents, and your live location quickly and securely. You can also use Status to share fleeting moments and updates, similar to stories. With billions of users relying on it daily, WhatsApp is the indispensable tool for private, seamless global communication, offering both simplicity and advanced security features for peace of mind.",
    "size": 45,
    "reviews": 182000000,
    "ratingAvg": 4.3,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 10000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 12000000 },
      { "name": "4 star", "count": 30000000 },
      { "name": "5 star", "count": 125000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/instagram.com",
    "title": "Instagram",
    "companyName": "Instagram",
    "id": 3,
    "description": "Create and share photos, stories, and reels with the friends and followers you care about. Instagram is your digital canvas and global stage for visual storytelling. Express yourself authentically through stunning photography, short, impactful video Reels set to trending audio, and immersive Stories that disappear after 24 hours. Connect with the people and things you love by exploring personalized feeds that feature content from accounts you follow and discover new creators through the Explore tab. Shop the latest styles and products directly from brands, watch live streams, and use Direct Messaging to chat privately or start a group conversation about a post. From meticulously curated grids to candid, in-the-moment updates, Instagram empowers you to cultivate your community, build a personal brand, and experience the world through captivating visuals.",
    "size": 160,
    "reviews": 150000000,
    "ratingAvg": 4.2,
    "downloads": 4500000000,
    "ratings": [
      { "name": "1 star", "count": 12000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 34000000 },
      { "name": "5 star", "count": 90000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/spotify.com",
    "title": "Spotify: Music and Podcasts",
    "companyName": "Spotify AB",
    "id": 4,
    "description": "Listen to songs, play podcasts, and create playlists with your favorite music. Spotify is the premier audio streaming service, offering millions of tracks and episodes across all genres and languages. Discover new music with personalized recommendations based on your listening history, or explore curated playlists for every mood, activity, and moment of the day. Enjoy high-quality audio streaming, both online and offline with Premium, and take your music with you wherever you go. The platform is also home to a vast and growing library of exclusive podcasts, covering news, comedy, true crime, and educational topics. From chart-topping hits to hidden gems, Spotify makes it effortless to find the perfect soundtrack for your life and dive deep into the world of audio entertainment, all in one seamless app.",
    "size": 95,
    "reviews": 32000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 22000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/snapchat.com",
    "title": "Snapchat",
    "companyName": "Snap Inc",
    "id": 5,
    "description": "Share the moment with friends and family using fast and fun photo messages. Snapchat is a dynamic, camera-first messaging app that encourages spontaneous, in-the-moment communication. Use the camera to capture Snaps—photos or short videos—then enhance them with playful Lenses, creative filters, text, and drawings before sending them to your friends. Messages disappear after they've been viewed, promoting a natural, less-pressured form of interaction. Stay up-to-date with your friends' daily lives via their Stories, or explore curated content from popular creators and publishers in the Discover section. The Snap Map lets you see what your friends are up to and what’s happening around the world. It’s the ultimate app for quick, fun, and authentic sharing.",
    "size": 125,
    "reviews": 35000000,
    "ratingAvg": 4.1,
    "downloads": 1500000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 17000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/youtube.com",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 6,
    "description": "Watch your favorite videos, channels, and playlists from around the world. YouTube is the world's most popular video platform, offering everything from music videos, gaming streams, and educational tutorials to original series and feature films. Subscribe to your favorite creators, stay informed with trending news, and explore a seemingly infinite catalog of content that caters to every interest imaginable. The app delivers a personalized home feed, making it easy to discover videos you'll love. Save videos to watch later, download them for offline viewing with YouTube Premium, and engage in real-time chats during live broadcasts. It’s an essential app for entertainment, learning, and staying connected to the global conversation through video.",
    "size": 140,
    "reviews": 145000000,
    "ratingAvg": 4.1,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 15000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 90000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/netflix.com",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 7,
    "description": "The leading subscription service for watching TV episodes and movies on your phone. Netflix offers an unparalleled library of premium content, including award-winning original series, blockbuster movies, thought-provoking documentaries, and stand-up comedy specials. The app provides a high-quality viewing experience with adaptive streaming, allowing you to watch in HD or even 4K resolution (where available) on your device. Enjoy seamless playback and pick up exactly where you left off on any device. Download your favorite titles to watch offline during commutes or while traveling, ensuring endless entertainment even without Wi-Fi. Personal recommendations help you discover your next obsession, making Netflix the go-to destination for on-demand, cinematic-quality entertainment.",
    "size": 80,
    "reviews": 18000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 11000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/amazon.com",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 8,
    "description": "Browse, search, view product details, read reviews, and purchase millions of products. The Amazon Shopping app brings the world's largest online marketplace directly to your smartphone. Enjoy a streamlined, secure, and personalized shopping experience, allowing you to find virtually anything you need—from groceries and electronics to fashion and home goods. Use features like voice search, image search (SmileCode and Scan It), and order tracking to make shopping efficient and transparent. Access your personalized recommendations, manage your wish lists, and take advantage of Prime member benefits like exclusive deals and fast, free shipping. With robust customer reviews and a trusted checkout process, the Amazon app is your essential mobile storefront.",
    "size": 78,
    "reviews": 8500000,
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1400000 },
      { "name": "5 star", "count": 6000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/roblox.com",
    "title": "Roblox",
    "companyName": "Roblox Corporation",
    "id": 9,
    "description": "The ultimate virtual universe that lets you create, share experiences, and be anything you can imagine. Roblox is a global platform where millions of users gather to explore immersive, user-generated 3D worlds. It's more than a game; it's a creative platform where the community designs and builds the games. Dive into a massive, ever-expanding library of experiences—role-playing games, obstacle courses (obys), simulations, and combat games. Personalize your avatar with countless items, chat with friends, and attend virtual concerts and events. The app is a safe, social environment that encourages creative coding and design, allowing users to not only play but also to imagine and construct their own digital playgrounds and monetize their creations.",
    "size": 165,
    "reviews": 38000000,
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 25000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/candycrushsaga.com",
    "title": "Candy Crush Saga",
    "companyName": "King",
    "id": 10,
    "description": "Switch and match candies in this tasty puzzle adventure to progress to the next level. Enter the delightful world of the Candy Kingdom, where matching three or more identical candies unleashes spectacular sweet combinations and power-ups. This globally loved match-3 game offers thousands of levels, each presenting a unique puzzle challenge, from clearing jelly to collecting specific ingredients. The game is designed with a satisfying progression system, colorful graphics, and addictive gameplay that is easy to pick up but challenging to master. Connect with friends to compare scores, send lives, and compete for the top spot on the leaderboard in this supremely popular, time-tested mobile gaming phenomenon.",
    "size": 210,
    "reviews": 40000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 30000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/telegram.org",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 11,
    "description": "Pure instant messaging — simple, fast, secure, and synced across all your devices. Telegram is a cloud-based messenger focused on speed and security, allowing you to access your messages from any device simultaneously, including phones, tablets, and desktops. It supports large group chats (up to 200,000 members), file sharing of any type up to 2 GB, and powerful channel broadcasting tools. Security is paramount, with optional Secret Chats that use end-to-end encryption and self-destructing messages. The platform is open, with a documented API and a vast community of developers creating custom bots and integrations. For those who prioritize speed, privacy, and powerful community tools, Telegram is the lightweight, feature-rich messaging choice.",
    "size": 68,
    "reviews": 14000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 8000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/uber.com",
    "title": "Uber - Request a ride",
    "companyName": "Uber Technologies, Inc.",
    "id": 12,
    "description": "The app that gets you where you need to go. Door-to-door safety standards and reliable rides. Uber offers a convenient, on-demand solution for transportation worldwide. Simply enter your destination, see the fare estimate upfront, and confirm your ride. You can track your driver's location in real-time, share your trip status with loved ones, and securely pay through the app. The commitment to safety includes features like 24/7 support, GPS tracking, and safety toolkits within the app. Whether you need an affordable commute option, a premium luxury ride, or a shared trip, Uber provides a reliable, efficient, and technologically advanced way to navigate your city and beyond.",
    "size": 110,
    "reviews": 12000000,
    "ratingAvg": 4.7,
    "downloads": 600000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/discord.com",
    "title": "Discord: Talk, Chat & Hang Out",
    "companyName": "Discord Inc.",
    "id": 13,
    "description": "Create a home for your communities and friends, where you can stay close and have fun over text and voice. Discord is the essential platform for organizing groups, discussing hobbies, and connecting with people who share your interests. Create private, invite-only servers where you can communicate with high-quality voice chat, persistent text channels, and video calls. It’s perfect for gaming groups, study sessions, art clubs, or any community. You can screen share, stream games, and use custom emojis to enhance the conversation. From casual hangouts to organized group events, Discord provides a flexible, robust, and feature-rich environment for digital communication and community building.",
    "size": 130,
    "reviews": 6500000,
    "ratingAvg": 4.2,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 750000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 3500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/airbnb.com",
    "title": "Airbnb",
    "companyName": "Airbnb, Inc.",
    "id": 14,
    "description": "Find vacation rentals, cabins, beach houses, unique homes, and experiences around the world. Airbnb transforms the way you travel by offering millions of unique lodging options hosted by local experts. Whether you're planning a weekend getaway, a month-long trip, or a solo adventure, you can book everything from entire homes, apartments, and treehouses to villas and castles. Beyond places to stay, discover unique \"Experiences\"—local activities and tours led by passionate hosts. The app makes booking, communicating with your host, and managing your itinerary effortless, offering a more authentic, personalized, and comfortable way to explore the globe.",
    "size": 145,
    "reviews": 2100000,
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 450000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/duolingo.com",
    "title": "Duolingo: Language Lessons",
    "companyName": "Duolingo",
    "id": 15,
    "description": "Learn a new language with the world’s most-downloaded education app. Free, fun, and effective. Duolingo turns language learning into an engaging, gamified experience. Choose from dozens of languages and progress through short, bite-sized lessons that cover reading, writing, listening, and speaking skills. Earn points, maintain your streak, compete with friends, and unlock new levels as you master vocabulary and grammar. The curriculum is backed by science and designed to be highly effective, delivering practical skills in a motivating and accessible format. Whether you're starting from scratch or looking to brush up on an existing skill, Duolingo makes achieving fluency a joyful daily habit.",
    "size": 65,
    "reviews": 16000000,
    "ratingAvg": 4.7,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 13000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/openai.com",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "id": 16,
    "description": "The official app by OpenAI. Get instant answers, find creative inspiration, and learn something new. ChatGPT is the leading conversational AI, designed to assist with a vast range of tasks and inquiries. Use it to instantly generate drafts of emails, essays, or code; brainstorm creative ideas for stories or projects; get quick explanations of complex topics; or engage in thought-provoking conversations. Its advanced natural language processing allows it to understand context and provide coherent, human-like responses. With seamless sync across devices and access to the latest model improvements, the ChatGPT app is an indispensable tool for boosting productivity, accelerating learning, and unlocking your creative potential on the go.",
    "size": 42,
    "reviews": 850000,
    "ratingAvg": 4.8,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 115000 },
      { "name": "5 star", "count": 700000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/doordash.com",
    "title": "DoorDash - Food Delivery",
    "companyName": "DoorDash",
    "id": 17,
    "description": "Delivery & takeout from the best local restaurants. Breakfast, lunch, dinner and more. DoorDash is your ultimate mobile solution for satisfying any craving, delivering meals from thousands of local favorites and national chains right to your doorstep. Browse comprehensive menus, filter by cuisine type, read genuine customer reviews, and place your order with a few simple taps. Track your order in real-time from the kitchen to your door, and enjoy secure, contactless delivery. The app also features DashPass for unlimited $0 delivery fees from eligible restaurants. Whether you're ordering a late-night snack, a family dinner, or catering for a group, DoorDash connects you to your community’s best culinary experiences quickly and reliably.",
    "size": 90,
    "reviews": 5500000,
    "ratingAvg": 4.6,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 3600000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/cash.app",
    "title": "Cash App",
    "companyName": "Block, Inc.",
    "id": 18,
    "description": "The easy way to send, spend, save, and invest your money. It’s the SAFE, FAST, and FREE mobile finance app. Cash App is an all-in-one financial tool that simplifies how you handle your money. Instantly send and receive money from friends and family with just a few taps. Get an optional, customizable Visa Debit Card (Cash Card) to spend the balance in your account anywhere. You can also buy, sell, and track stocks or Bitcoin directly within the app. Set up direct deposit for your paycheck to get paid up to two days early. With top-tier encryption and security features, Cash App provides a modern, accessible, and secure platform for managing your daily finances.",
    "size": 105,
    "reviews": 2800000,
    "ratingAvg": 4.6,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/canva.com",
    "title": "Canva: Design, Photo & Video",
    "companyName": "Canva",
    "id": 19,
    "description": "Your free photo editor and video editor in one graphic design app. Create social media posts, cards, and flyers. Canva makes professional-quality design accessible to everyone, regardless of skill level. Access thousands of beautifully designed, customizable templates for every use case: Instagram Stories, presentations, business logos, invitations, and more. Use the intuitive drag-and-drop interface, vast stock photo library, and extensive collection of fonts and elements to bring your vision to life. The app supports full photo editing, video trimming, and animated effects. Collaborate with team members, save your designs to the cloud, and easily share your creations directly to social media, making it the definitive tool for personal and professional design.",
    "size": 35,
    "reviews": 14000000,
    "ratingAvg": 4.8,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2200000 },
      { "name": "5 star", "count": 11000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/pinterest.com",
    "title": "Pinterest",
    "companyName": "Pinterest",
    "id": 20,
    "description": "Discover recipes, home ideas, style inspiration and other ideas to try. Pinterest is the visual discovery engine where millions of people find inspiration and plan their lives. Browse billions of Pins—images and videos—covering every topic you can imagine, from complex DIY projects and healthy meal prep to fashion trends and interior design concepts. Save your favorite ideas to customized boards, making it easy to organize your projects, future purchases, and dream lifestyle. The platform uses visual search to help you find similar ideas to any image you upload or discover. It's more than just a social network; it’s a powerful tool for cataloging inspiration and turning abstract ideas into tangible plans.",
    "size": 82,
    "reviews": 10500000,
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 750000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/pubgmobile.com",
    "title": "PUBG MOBILE",
    "companyName": "Level Infinite",
    "id": 21,
    "description": "The original Battle Royale on mobile. Extreme battles in 10-minute matches. Dive into the ultimate survival shooter experience where 100 players are air-dropped onto a massive, shrinking battlefield to fight until only one remains. Collect weapons, gear, and resources, and use tactical planning to outlast your rivals in intense, fast-paced combat. The mobile version features high-definition graphics, customizable controls, and a variety of maps and game modes, including team deathmatch and quick match options. Team up with friends in voice chat, coordinate strategies, and climb the ranks in the global leaderboard. With continuous updates adding new content and events, PUBG MOBILE offers a competitive, console-quality Battle Royale experience on the go.",
    "size": 850,
    "reviews": 45000000,
    "ratingAvg": 4.3,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 25000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/reddit.com",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 22,
    "description": "Dive into your interests. Join communities, discuss topics, and share content on the front page of the internet. Reddit is a massive collection of forums, known as \"subreddits,\" where users discuss every conceivable topic—from niche hobbies and current events to personal advice and humor. The content is driven entirely by its users, who submit links, text posts, images, and videos, which are then upvoted or downvoted by the community to determine visibility. You can follow your passions, engage in in-depth conversations, and discover original content you won't find anywhere else. Log in to personalize your feed and join the lively, sometimes quirky, and always engaging global digital town square.",
    "size": 60,
    "reviews": 3500000,
    "ratingAvg": 4.1,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/paypal.com",
    "title": "PayPal - Send, Shop, Manage",
    "companyName": "PayPal Mobile",
    "id": 23,
    "description": "Send money, pay bills, and manage your account with the secure and easy-to-use digital wallet. PayPal is a globally recognized financial platform that provides a secure way to manage online transactions. Link your bank account or card to send money to friends and family in seconds, often with zero fees for personal transfers. Use the app to securely check out at millions of online stores without having to enter your credit card details every time. Manage your balance, track your purchase history, and handle international payments with ease. With its buyer protection and industry-leading encryption, PayPal offers a trusted, convenient, and comprehensive solution for your digital payment needs.",
    "size": 85,
    "reviews": 4200000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/shein.com",
    "title": "SHEIN-Shopping Online",
    "companyName": "Roadget Business PTE. LTD.",
    "id": 24,
    "description": "Discover the latest fashion trends and shop for women's, men's, and kids' clothing. SHEIN is a leading global e-commerce platform specializing in affordable, on-trend fashion and lifestyle products. The app is updated daily with thousands of new arrivals, allowing you to easily browse and purchase the newest styles across clothing, accessories, shoes, and home goods. Enjoy competitive prices, daily flash deals, and exclusive coupons. Use the search and filter tools to quickly find exactly what you're looking for, read detailed size guides and customer reviews, and track your orders from purchase to delivery. SHEIN makes keeping your wardrobe updated and experimenting with new looks both fun and budget-friendly.",
    "size": 115,
    "reviews": 6800000,
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 5000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/linkedin.com",
    "title": "LinkedIn: Jobs & Business News",
    "companyName": "LinkedIn",
    "id": 25,
    "description": "Build your professional network, find jobs, and read the latest industry news. LinkedIn is the world's largest professional networking platform, designed to help you advance your career. Connect with colleagues, industry leaders, and potential employers. The app provides a feed of professional news and articles tailored to your field, keeping you informed about market trends and company updates. Use the robust job search engine to apply for positions, receive personalized job recommendations, and privately message recruiters. From mastering new skills with LinkedIn Learning to showcasing your accomplishments on your profile, it’s the essential tool for professional development and career management.",
    "size": 180,
    "reviews": 3200000,
    "ratingAvg": 4.1,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/shazam.com",
    "title": "Shazam: Music Discovery",
    "companyName": "Apple Inc.",
    "id": 26,
    "description": "Identify any song in seconds. Discover, artists, lyrics, videos and playlists. Shazam is the magic button for music discovery. Simply hold your phone up when you hear a song you like, and the app will instantly name the track, artist, and album. Once Shazamed, you can explore the official music video, view the song’s lyrics, and connect to popular streaming services like Spotify and Apple Music to add it to your playlists. The app keeps a history of all your discoveries, helping you rediscover those catchy tunes you hear throughout the day. It’s an indispensable utility for music lovers who want to instantly unlock the information behind any sound they hear.",
    "size": 25,
    "reviews": 7500000,
    "ratingAvg": 4.8,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 6500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/weather.com",
    "title": "The Weather Channel",
    "companyName": "The Weather Channel",
    "id": 27,
    "description": "Live radar updates, severe weather alerts, and local forecast on the go. The Weather Channel app provides highly accurate and reliable weather information, ensuring you are always prepared for the day ahead. Get hourly, daily, and 15-day forecasts, complete with details on temperature, wind speed, humidity, and UV index. The interactive radar maps show precipitation, snow, and severe storm paths in real-time. Receive timely alerts for thunderstorms, hurricanes, or winter storms, allowing you to take action before danger strikes. With detailed localized forecasts and a clean, intuitive interface, it's the trusted resource for global weather intelligence and keeping you safe and informed.",
    "size": 60,
    "reviews": 3100000,
    "ratingAvg": 4.6,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 2250000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/twitter.com",
    "title": "X",
    "companyName": "X Corp.",
    "id": 28,
    "description": "Breaking news, entertainment, sports, politics, and everything in between. X (formerly Twitter) is the real-time social platform where global conversations unfold instantly. Follow accounts of journalists, celebrities, political figures, and friends to get immediate updates on what's happening in the world right now. Participate in the global conversation by posting short, impactful messages, sharing images and videos, and engaging in threads. The Explore tab curates trending topics and tailored content, making it easy to see what the world is talking about. It’s the definitive platform for breaking news, rapid-fire discussion, and staying connected to the pulse of culture and current events.",
    "size": 95,
    "reviews": 22000000,
    "ratingAvg": 4.0,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 11000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/twitch.tv",
    "title": "Twitch: Live Game Streaming",
    "companyName": "Twitch Interactive, Inc.",
    "id": 29,
    "description": "Watch livestream gaming, esports, and any IRL broadcast on your Android device. Twitch is the world's leading live video streaming platform, particularly dominant in the gaming and esports sectors. Tune in to watch your favorite streamers play top titles, view professional gaming tournaments, or explore \"IRL\" (In Real Life) streams covering art, music, cooking, and more. Engage directly with streamers and other viewers via live chat, subscribe to support your favorite channels, and discover new communities. The app provides high-quality video playback and push notifications for when your followed channels go live, ensuring you never miss a moment of the action or your favorite personalities.",
    "size": 112,
    "reviews": 5400000,
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 3500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/nike.com",
    "title": "Nike: Shoes, Apparel & Stories",
    "companyName": "Nike, Inc.",
    "id": 30,
    "description": "Shop the latest sneakers and apparel, and get exclusive access to new releases. The Nike App is the ultimate companion for sneakerheads, athletes, and fitness enthusiasts. Browse and purchase the complete catalog of Nike footwear, clothing, and gear, with curated recommendations based on your style and activity. Get priority access to \"SNKRS Draw\" and other exclusive drops and launches often unavailable anywhere else. Read inspirational stories from professional athletes and learn about the innovation behind their products. The app offers a seamless shopping experience, easy returns, and personalized content, making it the definitive mobile destination for all things Nike.",
    "size": 130,
    "reviews": 2100000,
    "ratingAvg": 4.7,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 1630000 }
    ]
  }
]